app/controllers/films_controller.rb

  def index
	  	require 'digest/sha1'
		@rep_sources = RepSource.all
---
SELECT "rep_sources".* FROM "rep_sources"