app/controllers/rep_sources_controller.rb

  def index
    @rep_sources = RepSource.all
---
SELECT "rep_sources".* FROM "rep_sources"

  def show
    @rep_source = RepSource.find(params[:id])
---
SELECT "rep_sources".* FROM "rep_sources" WHERE ("rep_sources"."id" = 1) LIMIT 1

  def edit
    @rep_source = RepSource.find(params[:id])
---
SELECT "rep_sources".* FROM "rep_sources" WHERE ("rep_sources"."id" = 1) LIMIT 1

  def create
    @rep_source = RepSource.new(params[:rep_source])

    respond_to do |format|
      if @rep_source.save
---
INSERT INTO "rep_sources" ("created_at", "path", "updated_at") VALUES ('2010-04-18 12:27:56.881528', '/User/albanavenant/Movies', '2010-04-18 12:27:56.881528')

  def update
    @rep_source = RepSource.find(params[:id])

    respond_to do |format|
      if @rep_source.update_attributes(params[:rep_source])
---
SELECT "rep_sources".* FROM "rep_sources" WHERE ("rep_sources"."id" = 1) LIMIT 1
UPDATE "rep_sources" SET "path" = '/Users/albanavenant/Movies', "updated_at" = '2010-04-18 13:48:08.414295' WHERE ("rep_sources"."id" = 1)